In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')

In [8]:
slice_df = df.loc[df.Lat < 0, ['Country/Region', 'Lat', '1/20/22']].sort_values(by='1/20/22', ascending=False).head()
slice_df

    Country/Region      Lat   1/20/22
31          Brazil -14.2350  23595178
7        Argentina -38.4161   7576335
149      Indonesia  -0.7893   4277644
236   South Africa -30.5595   3572860
212           Peru  -9.1900   2780049

In [15]:
brazil = slice_df.iloc[0, 2]

In [16]:
indonesia = slice_df.iloc[2, 2]

In [17]:
perbandingan = brazil / indonesia
perbandingan

5.515928394228225

In [37]:
def daily_case(df, country):
    df_t = df.T
    df_t.rename(columns=df_t.iloc[1], inplace=True)
    df_t = df_t.iloc[4:, :]

    case = df_t[country].diff()
    index = df_t.index

    df_daily = pd.DataFrame({'date': index,
    country: case}).reset_index(drop=True)
    return df_daily

In [38]:
daily_case(df, 'Indonesia')

        date Indonesia
0    1/22/20       NaN
1    1/23/20         0
2    1/24/20         0
3    1/25/20         0
4    1/26/20         0
..       ...       ...
756  2/16/22     64718
757  2/17/22     63956
758  2/18/22     59635
759  2/19/22     59384
760  2/20/22   -182975

[761 rows x 2 columns]

In [39]:
daily_indo = daily_case(df, 'Indonesia')

In [52]:
daily_indo[daily_indo['Indonesia'] == daily_indo['Indonesia'].max()]

        date Indonesia
756  2/16/22     64718

In [48]:
daily_indo[daily_indo['date'] == '1/20/22']

        date Indonesia
729  1/20/22      2116

In [49]:
ratio = 64718 / 2116
ratio

30.58506616257089

In [53]:
# loop for
case_under10k = []

for i in daily_indo['Indonesia']:
    if i < 10000:
        case_under10k.append(i)

len(case_under10k)

633

In [54]:
# loop while
counter = 0
case_u10k = []
while counter < len(daily_indo['Indonesia']):
    if daily_indo.iloc[counter, 1] < 10000:
        case_u10k.append(daily_indo.iloc[counter, 1])

    counter += 1

len(case_u10k)

633